Revit 2027 API
EnergyDataSettings.IsExportMullionsEnabled Property
 Indicates if mullions are included in GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsExportMullionsEnabled { get; }
Public ReadOnly Property IsExportMullionsEnabled As Boolean
	Get
public:
property bool IsExportMullionsEnabled {
	bool get ();
}
member IsExportMullionsEnabled : bool with get
Property Value
Boolean
Remarks
 Result is based on the ExportComplexity setting. When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical shading surface is produced from a mullion based on its centerline, thickness, and offset.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace